# AreaReinforcementOutSideOfHost Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..RebarSystemFailures..::..AreaReinforcementOutSideOfHost Property
BuiltInFailures..::..RebarSystemFailures Class See Also
---
Area Reinforcement is sketched completely outside of its host.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId AreaReinforcementOutSideOfHost { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property AreaReinforcementOutSideOfHost As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ AreaReinforcementOutSideOfHost {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..RebarSystemFailures Class
Autodesk.Revit.DB Namespace